Repository: Peda1996/CMM
Catalog: po/*.po
Languages: de

source: Please select a directory for your new profile
de: Bitte wähle einen Ordner zum Erstellen deines neuen Profils

source: Welcome
de: Willkommen

source: Select Profile
de: Profil wählen

source: Find
de: Finden

source: Open existing profile
de: Existierendes Projekt öffnen

source: Open an existing profile which is not<br>listed below by selecting its directory.
de: Ein anderes Profil öffnen

source: New
de: Neu

source: Create new profile
de: Neues Profil erstellen

source: Create a new profile and save it<br>anywhere on your computer.
de: Erstelle ein neues Profil

source: Launch without profile
de: Ohne Profil starten

source: Launch C Compact without profile
de: C Compact ohne Profil starten

source: In this mode, you will not be able to do quests,<br>however you can still use all other features of C Compact.
de: In diesem Modus kannst du keine Aufgaben ausführen,<br>alle weiteren Funktionen von C Compact sind aber verfügbar.

source: No recent profiles
de: keine vergangenen Profile

source: Select this profile
de: Dieses Profil wählen

source: Click image to change start<br>C Compact with this profile
de: Auf das Bild klicken, um<br>C Compact mit diesem Profil zu starten

source: Quest successfully completed
de: Aufgabe abgeschlossen

source: Run Test
de: Test starten

source: Package
de: Paket

source: All Packages
de: Alle Pakete

source: Test Parameters
de: Testparameter

source: Input Data
de: Eingabedaten

source: Correct Output
de: Korrekte Ausgabe

source: Your Program's Output
de: Ausgabe deines Programmes

source: Test Progress
de: Fortschritt

source: Cancel
de: Abbrechen

source: Achievements
de: Auszeichnungen

source: About C Compact
de: Über C Compact

source: Profile Information
de: Profilinformation

source: No Profile choosen
de: Kein Profil ausgewählt

source: Current Quest
de: Aktuelle Quest

source: Select Quest
de: Quest wählen

source: File
de: Datei

source: Open
de: Öffnen

source: Recent files
de: Zuletzt benutzte Dateien

source: Save As...
de: Speichern unter

source: Save
de: Speichern

source: Print
de: Drucken

source: Properties
de: Einstellungen

source: Language
de: Sprache

source: Exit
de: Beenden

source: Cut
de: Ausschneiden

source: Copy
de: Kopieren

source: Paste
de: Einfügen

source: Undo
de: Rückgängig

source: Redo
de: Wiederholen

source: compile and run
de: Compilieren und ausführen

source: compile and step
de: Compilieren und Schrittweise debuggen

source: Progress
de: Fortschritt

source: Export Profile
de: Profil exportieren

source: Import Quest Package
de: Questpaket importieren

source: Input
de: Eingabe

source: Output
de: Ausgabe

source: Opening new file
de: Neue Datei öffnen

source: Type
de: Datentyp

source: Value
de: Wert

source: Variable table columns
de: Tabellenspalten

source: You can change the width a column by<br>dragging and sliding its border.
de: Die Breite der Spalten kann mit<br>der Maus verändert werden.

source: Unnamed
de: Unbenannt

source: Jump to Declaration
de: Gehe zur Deklaration

source: Jump to Call
de: Gehe zum Aufruf

source: Error
de: Fehler

source: test successful
de: Test erfolgreich

source: test failed
de: Test fehlgeschlagen

source: testing current quest
de: Aktuelle Quest testen

source: no quest selected
de: Keine Aufgabe ausgewählt

source: current quest
de: Aktuelle Quest

source: file
de: Datei

source: Would you like to replace the existing file?
de: Willst du die existierende Datei ersetzen?

source: This file does already exist
de: Datei existiert bereits

source: Yes
de: Ja

source: No
de: Nein

source: Do you want to save the new file?
de: Willst du die neue Datei speichern?

source: Save now
de: Speichern

source: Close without saving
de: Nicht speichern

source: The current file has not yet been saved!
de: Die aktuelle Datei wurde noch nicht gespeichert

source: click to change name
de: Hier clicken, um den Namen zu ändern

source: click here to change your<br>profile name
de: Hier klicken, um den<br>Profilnamen zu ändern

source: click to change image
de: Profilbild ändern

source: click here and select your<br>profile image
de: Hier klicken, um das<br>Profilbild auszuwählen

source: Corrupted Avatar
de: Datei beschädigt

source: Corrupted Image
de: Bild beschädigt

source: return to text edit mode immediately
de: sofort zurück zum Editormodus

source: sec
de: sek

source: debugger step delay
de: Verzögerung beim Auto-Debugging

source: change this value with<br>the slider below
de: Dieser Wert kann mit dem<br>Regler verändert werden

source: change automatic debugging<br>delay with this slider
de: Verzögerung beim automatischen<br>Programmablauf kann mit diesem Regler<br>verändert werden

source: compile source code<br>and run debugger
de: Compiliere source code und<br>führe das Programm automatisch aus

source: compile source code and<br>run debugger step by step
de: Compiliere source code und<br>führe das Programm Schritt für Schritt aus

source: pause automatic debugging
de: Automatisches Debuggen pausieren

source: next step
de: Nächster Schritt

source: proceed to next step manually
de: nächsten Schritt ausfhren

source: run automatic debugging
de: Automatische Ausführung starten

source: Control elements
de: Kontrollelemente

source: Variables
de: Variablen

source: Closing C Compact
de: C Compact wird geschlossen

source: Proceed without saving
de: Fortsetzen ohne zu speichern

source: The following file could not be found:
de: Die folgende Datei wurde nicht gefunden:

source: File does not exist
de: Datei existiert nicht

source: C Compact was not able to save your personal settings
de: C Compact konnte deine persönlichen Einstellungen nicht speichern

source: The program returned
de: Das Programm endete mit

source: Unable to save your settings
de: Einstellungen konnten nicht gespeichert werden

source: Source code font size
de: Schriftgröße des Sourcecode

source: pixels
de: Pixel

source: Text field font size
de: Schriftgröße der Textfelder

source: Document font size
de: Schriftgröße von Dokumenten

source: Interface Layout
de: Ansicht

source: Classic Vertical
de: Klassisch, Vertikal

source: Classic Horizontal
de: Klassisch, Horizontal

source: Widescreen Central
de: Widescreen, Zentral

source: Widescreen Left
de: Widescreen, Links

source: Debugger options
de: Debuggeroptionen

source: Show return values
de: Rüchgabewerte anzeigen

source: Variable table font size
de: Schriftgröße der Variablentabelle

source: medium
de: normal

source: small
de: klein

source: large
de: groß

source: extra large
de: sehr groß

source: giant
de: riesig

source: Choose a language
de: Wähle eine Sprache

source: text edit mode
de: Editormodus

source: error
de: Fehler

source: in line
de: in Zeile

source: automatic debug mode
de: Automatischer Debugmodus

source: pause or step by step mode
de: Pause oder schrittweises Debuggen

source: Disposing
de: Wird geschlossen

source: Show contents
de: Inhalt zeigen
